Revit 2027 API
SelectionFilterElement.AddSingle Method
 Adds a single ElementId to the filter's set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSingle(
	ElementId id
)
Public Sub AddSingle (
	id As ElementId
)
public:
void AddSingle(
	ElementId^ id
)
member AddSingle :
        id : ElementId -> unit
Parameters
id ElementId
 The ElementId to add.
Exceptions
Exception | Condition
ArgumentException |  Invalid ElementId
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SelectionFilterElement Class
Autodesk.Revit.DB Namespace